Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/the_irish_government/composition_of_the_government.html.txt.tmx
Source language: en
Languages: ga

source: Article 28 of Bunreacht na hÉireann (the Irish Constitution) sets out the composition of Government
ga: Leagann alt 28 Bunreacht na hÉireann síos comhdhéanamh na Rialtais

source: The Constitution states that the Government must not be smaller than 7 members or larger than 15 members
ga: Deireann Bunreacht na hÉireann go bhfuil gá le níos mó ná 7 mball agus gan níos mó ná 15 ball a bheith in aon Rialtas

source: The Taoiseach is the head of the Irish Government
ga: Tá an Taoiseach i gceannas an Rialtais

source: He or she is nominated by the Dáil (one of the houses of Parliament) and formally appointed by the Irish President
ga: Cuireann an Dáil a hainm nó a ainm ar aghaidh agus glacann an tUachtarán go foirimiúil leis an ainmiú

source: Normally, each of the political parties or a coalition of parties will have its own nominee for Taoiseach
ga: De ghnáth cuireann gach páirtí polaitiúil, nó gach comhrialtas páirtithe, ainm chun cinn le seasamh mar Thaoiseach

source: The nominee who has the support of the majority of the members of the Dáil will become Taoiseach
ga: An té a fhaigheann tacaíocht ó thromlach na mball sa Dáil a bheidh ina T(h)aoiseach

source: The Taoiseach then nominates the other members of the Government and gives each of them a Department of State
ga: Ainmníonn an Taoiseach, ansin, baill eile den Rialtas agus tugann Roinn Stáit dóibh

source: They are approved by the Dáil and appointed by the President. You can view this list of current Irish Government Ministers
ga: Faigheann siad seo tacaíocht na Dála agus glacann an tUachtarán leis an gceapáchán

source: If the Government is made up of 2 or more political parties, it is called a coalition government
ga: Má tá níos mó ná páirtí polaitiúil amháin sa Rialtas tugtar comhrialtas ar an gcinéal seo Rialtais

source: The 2 parties will share the positions in the Government - usually the position of Tánaiste is given to the leader of the smaller party in coalition
ga: Roinneann na páirtithe na postanna sa Rialtas - de ghnáth tugtar post an Tánaiste do cheannaire an pháirtí is lú sa chomhrialtas

source: The members of the Government must be members of either Dáil Éireann or Seanad Éireann
ga: Ní mór do bhaill an Rialtais a bheith ina mbaill de Dáil Éireann nó ina mbaill de Sheanad Éireann

source: There cannot be more than 2 members of Seanad Éireann appointed to the Government
ga: Ní féidir níos mó na beirt bhall de Sheanad Éireann a bheith ina mbaill den Rialtas

source: The Taoiseach, the Tánaiste and the Minister for Finance must be members of Dáil Éireann
ga: Caithfidh an Taoiseach, an Tánaiste agus an tAire Airgeadais a bheith ina mbaill de Dháil Éireann

source: The Taoiseach may also appoint Ministers of State who are also known as Junior Ministers
ga: Is féidir leis an Taoiseach Airí Stáit a roghnú freisin, ainm eile a thugtar orthu ná Airí Sóisearacha

source: They are not actually members of the Cabinet but they help Government ministers in their parliamentary and departmental work
ga: Ní baill den chomh-aireacht iad ach cuidíonn siad leis na hAirí Rialtais ina gcuid oibre Rialtais agus ina gcuid oibre sa Roinn atá faoina gcúram

source: The Taoiseach will also appoint an Attorney General to advise the Government on legal issues
ga: Roghnaíonn an Taoiseach Ard-Aighne, freisin, chun comhairle dlí a chuir ar fáil don Rialtas

source: The Attorney General is not a member of the Government but he/she traditionally attends at Cabinet meetings
ga: Ní ball den Rialtas An tArd-Aighne ach de réir traidisiún déanann sé/sí freastal ar chruinnithe den chomh-aireacht
